#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time     : 2022/4/27 18:19
# @Author   : Hanyiik
# @File     : get_eletrodes.py
# @Function : 

import numpy as np
import torch
import os
import pdb


if __name__ == '__main__':

    # a = ""
    # b = a.replace(' ', ', ')
    # print(b)

    # input_cam = np.array([1., 0.95801696, 0.98456998, 0.5741123, 0.56882552, 0.7161385, 0.65108147, 0.60084394, 0.57734684, 0.50775793, 0.55058812, 0.58296378,
    #                       0.64412447, 0.73343805, 0.60186851, 0.48540677, 0.41169906, 0.42761086, 0.45763781, 0.42386113, 0.42196585, 0.48672619, 0.62007145,
    #                       0.45320964, 0.28822756, 0.31385368, 0.40124088, 0.41024367, 0.41851009, 0.33504025, 0.33077548, 0.4829989, 0.3138901, 0.15976712,
    #                       0.23131427, 0.3185402, 0.41524828, 0.36809461, 0.29159978, 0.21498555, 0.36062323, 0.24853807, 0.08541498, 0.13109085, 0.24277986,
    #                       0.30506231, 0.30138395, 0.19719028, 0.14674479, 0.27992576, 0.21561072, 0.05578917, 0., 0.14901535, 0.06092695, 0.11170272, 0.24890005,
    #                       0.2165628, 0.20902294, 0.25737978, 0.23951627, 0.25113441])

    input_cam = np.array([0., 0.33834018, 0.24241423, 0.34684275, 1., 0.54732606, 0.69725331, 0.39849934, 0.3382053, 0.59471839, 0.41129678, 0.51970634, 0.73704646,
                          0.48496951, 0.39139661, 0.17019914, 0.031596, 0.031596, 0.20092202, 0.031596, 0.20644174, 0.42231674, 0.33767678, 0.27651178, 0.031596,
                          0.031596, 0.031596, 0.031596, 0.031596, 0.031596, 0.031596, 0.49232538, 0.031596, 0.031596, 0.031596, 0.031596, 0.031596, 0.031596,
                          0.031596, 0.031596, 0.3161992, 0.031596, 0.031596, 0.031596, 0.031596, 0.031596, 0.031596, 0.031596, 0.031596, 0.031596, 0.031596,
                          0.031596, 0.031596, 0.031596, 0.031596, 0.031596, 0.031596, 0.031596, 0.031596, 0.031596, 0.031596, 0.031596])
    # 得到 CAM (100, 62), 代表这 100 张 graph 中每张 graph 62 个点的热力值
    nodes_cam = torch.from_numpy(input_cam)

    # 制作 MASK (100, 62), 分布在 0~1
    heat_max = torch.max(nodes_cam)
    heat_min = torch.min(nodes_cam)
    nodes_mask = (nodes_cam - heat_min) / (heat_max - heat_min)

    # 凡是小于 rate 的地方，均置零
    cam = torch.sign(torch.sign(nodes_mask - 0.5) + 1)

    # 得到选中点的 indices
    indices_list = torch.nonzero(cam).squeeze(1).numpy()

    loc_name=[]
    f=open('./locs.txt')
    while True:
        line = f.readline().replace(' ', '').strip()
        if not line:
            break
        name = line[-3:].strip()
        loc_name.append(name)

    hot_electrodes=[]
    for i in indices_list:
        hot_electrodes.append(loc_name[i])

    nonhot_electrodes=[]
    for j in range(62):
        if j not in indices_list:
            nonhot_electrodes.append(loc_name[j])

    print(f"被选中的通道名称: {hot_electrodes}")
    print(f"未被选中的通道名称: {nonhot_electrodes}")

